Repository: lawrancej/logisim
Catalog: xlate/ru/doc/omegat-logisim-doc_ru-omegat.tmx
Source language: en
Languages: ru_ru

source: If the distribution and/or use of the Program is restricted in certain countries either by patents or by copyrighted interfaces, the original copyright holder who places the Program under this License may add an explicit geographical distribution limitation excluding those countries, so that distribution is permitted only in or among countries not thus excluded.
ru_ru: Если распространение и/или применение Программы ограничено в ряде стран либо патентами, либо авторскими правами на интерфейсы, первоначальный обладатель авторских прав, выпускающий Программу с этой Лицензией, может добавить явное ограничение на географическое распространение, исключив такие страны, так что распространение разрешается только в тех странах, которые не были исключены.

source: Above these parts are the menu bar and the toolbar.
ru_ru: Выше этих частей - строка меню и панель инструментов.

source: East edge, labeled > (output, bit width 1)
ru_ru: Восточный край, отмечен > (выход, разрядность равна 1)

source: The Template tab
ru_ru: Вкладка Шаблон

source: In addition, clicking or dragging the mouse with the control key pressed regularly snaps the mouse position to the nearest grid point.
ru_ru: Кроме того, щелчок или перетаскивание мыши с зажатой Control "приклеивает" положение мыши к ближайшему узлу сетки.

source: Move Circuit Down
ru_ru: Переместить схему вниз

source: Incidentally, every pin to a circuit must be either an input or an output.
ru_ru: Кстати, каждый контакт схемы должен быть либо входом, либо выходом.

source: 2.0.3 (in Base library, moved to Wiring in 2.7.0)
ru_ru: 2.0.3 (в библиотеке Базовые, перемещён в библиотеку Проводка в 2.7.0)

source: The image file can use run-length encoding; for example, rather than list the value 00 sixteen times in a row, the file can include 16*00.
ru_ru: Файл образа может использовать кодирование повторов; например, вместо перечисления значения 00 шестнадцать раз подряд, файл может включать 16*00.

source: /** The current value emitted by the counter.
ru_ru: /** Текущее значение, выдаваемое счётчиком.

source: Units in the Logisim help system include:
ru_ru: Секции в справочной системе Logisim включают:

source: Create a sequence of connected lines, whose vertices are indicated by a succession of clicks.
ru_ru: Создать последовательность соединённых линий, вершины которых указываются последовательностью щелчков.

source: You may copy and distribute verbatim copies of the Program's source code as you receive it, in any medium, provided that you conspicuously and appropriately publish on each copy an appropriate copyright notice and disclaimer of warranty; keep intact all the notices that refer to this License and to the absence of any warranty; and give any other recipients of the Program a copy of this License along with the Program.
ru_ru: Вы можете копировать и распространять дословные копии исходного кода Программы по его получении на любом носителе, при условии что вы соответствующим образом помещаете на видном месте в каждой копии соответствующее уведомление об авторских правах и отказ от гарантий; оставляете нетронутыми все уведомления, относящиеся к данной Лицензии и к отсутствию каких-либо гарантий; и передаете всем другим получателям Программы копию данной Лицензии вместе с Программой.

source: Maybe the assignment was to build a two-bit adder.
ru_ru: Например, задание было построить двухбитный сумматор.

source: Multi-bit wires will turn red when any of the bits carried are error values.
ru_ru: Многобитные провода станут красными, если какие-либо биты несут значение ошибки.

source: Plexers
ru_ru: Плексоры

source: Next: The International tab.
ru_ru: Далее: Вкладка Интернациональные.

source: The canvas is where you'll draw your circuit; and the toolbar contains the tools that you'll use to accomplish this.
ru_ru: Холст - это место, где вы будете рисовать вашу схему; а панель инструментов содержит инструменты, которые вы будете использовать для достижения этой цели.

source: If there is a single load/store port, the value read from this port is stored whenever a store is requested.
ru_ru: Если представлен один порт чтения/записи, то когда запрошена запись, значение, считанное по этому порту, записывается в память.

source: At the bottom of the window is the Revert All To Template button.
ru_ru: В нижней части окна есть кнопка Вернуть все к шаблону.

source: When you click the Build Circuit button, a dialog box will appear prompting you to choose which project where you want the circuit and the name you wish to give it.
ru_ru: Когда вы нажмёте кнопку Построить схему, появится диалоговое окно с приглашением выбрать, в каком проекте и с каким названием вы хотите построить схему.

source: Comparator
ru_ru: Компаратор

source: Shift-clicking ensures that the angle between the previous vertex and the current one is a multiple of 45°.
ru_ru: Щелчок с Shift обеспечивает то, что угол между предыдущей и текущей вершинами кратен 45°.

source: I happen to like the antiquated terms.)
ru_ru: Мне нравятся устаревшие термины.)

source: Shifter
ru_ru: Сдвигатель

source: Options for the -tty parameter
ru_ru: Аргументы для параметра -tty

source: Raise To Top
ru_ru: Поднять наверх

source: The counter increments.
ru_ru: Значение счётчика увеличивается на единицу.

source: Otherwise, clicking the mouse within a component drops all components from the current selection and selects instead the component(s) containing the clicked location.
ru_ru: В противном случае, при нажатии мыши в пределах компонента сбрасываются все компоненты из текущего выделения и вместо них выбирается компонент(ы), содержащий точку нажатия.

source: The value rising edge indicates that the register should update its value at the instant when the clock rises from 0 to 1.
ru_ru: Значение Передний фронт означает, что регистр должен обновляться в момент, когда значение на тактовом входе меняется с 0 на 1.

source: Pressing the button there initiates the addition of a new wire.
ru_ru: Нажатие кнопки в этом месте инициирует добавление нового провода.

source: A bit can be specified to correspond to none of the split ends.
ru_ru: Бит может быть задан не соответствующим ни одному из разделённых концов.

source: /** Constructs a state with the given values.
ru_ru: /** Создает состояние с заданными значениями.

source: The number of stages included in the component.
ru_ru: Количество ступеней, включенных в компонент.

source: A tick is the base unit of measurement for the speed of clocks.
ru_ru: Такт - это основная единица измерения скорости тактовых генераторов.

source: The explorer pane
ru_ru: Панель проводника

source: The controlled buffer and inverter, often called three-state buffers/inverters, each have a one-bit "control" input pin on the south side.
ru_ru: Управляемые буфер и инвертор, часто называемые буфер/инвертор с тремя состояниями, имеют однобитный входной контакт на южном крае.

source: This static
ru_ru: Этот статический

source: Their exact behavior depends on the flip-flop; the above tables summarize their behavior.
ru_ru: Их точное поведение зависит от триггера; приведенная выше таблица описывает его.

source: D on east edge (input/output or output, bit width matches Data Bit Width attribute)
ru_ru: D на восточном крае (вход/выход или выход, разрядность соответствует атрибуту Разрядность данных)

source: For example, for a 5x7 matrix, if the first input is 01010 and the second is 0111010, then the second and fourth columns are lit for the second, third, fourth, and sixth rows; the result appears to be a pair of exclamation points.
ru_ru: Например, для матрицы 5x7, если на первом входе 01010, а на втором 0111010, то второй и четвертый столбец горит для второй, третьей, четвертой и шестой строки; результат будет выглядеть как пара восклицательных знаков.

source: The distinction between Unique and Recursive is easiest to explain by considering the 4:1 multiplexer built using three 2:1 multiplexers as in the Using subcircuits section.
ru_ru: Различие между Уникальных и Рекурсивно проще всего объяснить, рассматривая мультиплексор 4:1, построенный с использованием трёх мультиплексоров 2:1, как в разделе Использование подсхем.

source: If no, it is colored when the input is 0.
ru_ru: Если нет , то он подсвечен, когда на входе 0.

source: Logical Right: All bits in data are shifted down dist places, with the upper dist places filled with 0's.
ru_ru: Логический правый: все биты в данные сдвигаются вниз на дистанция позиций, а верхние дистанция позиций заполняются нулями.

source: The XOR, XNOR, Even Parity, and Odd Parity gates each compute the respective function of the inputs, and emit the result on the output.
ru_ru: Элементы Исключающее ИЛИ, Исключающее ИЛИ-НЕ, Нечётность и Чётность вычисляют соответствующую функцию от значений на входах и выдают результат на выход.

source: The component supports the following shift types:
ru_ru: Компонент поддерживает следующие типы сдвига:

source: This example by itself is not enough to create a working JAR file; you must also provide a Library class, as illustrated on the next page.
ru_ru: Этого примера самого по себе недостаточно, чтобы создать работающий JAR файл; вы должны ещё предусмотреть класс Library, как показано на следующей странице.

source: Create a quadratic Bezier curve.
ru_ru: Создать квадратичную кривую Безье.

source: Advances the simulation one step forward.
ru_ru: Продвигает моделирование на один шаг вперёд.

source: It does not display values for multi-bit wires: They are simply black.
ru_ru: Значения, передаваемые многобитными проводами не отображаются: они просто чёрные.

source: If the value is unknown (i.e., floating), then it is assumed to be 0.
ru_ru: Если значение неизвестно (например, плавающее), то предполагается, что оно равно 0.

source: To remove a library, choose Unload Library... from the Project menu.
ru_ru: Чтобы удалить библиотеку, выберите Выгрузить библиотеки... из меню Проект.

source: By default, when a subcircuit is placed within a larger circuit, it is drawn as a rectangle with a notch indicating the north end of the subcircuit's layout.
ru_ru: Когда подсхема размещена внутри большей схемы, по умолчанию она отрисована в виде прямоугольника с выемкой, обозначающей северный конец чертежа подсхемы.

source: The Experimental tab
ru_ru: Вкладка Экспериментальные

source: package com.cburch.gray; import com.cburch.logisim.data.BitWidth; import com.cburch.logisim.data.Value; import com.cburch.logisim.instance.InstanceData; import com.cburch.logisim.instance.InstanceState; /** Represents the state of a counter.
ru_ru: package com.cburch.gray; import com.cburch.logisim.data.BitWidth; import com.cburch.logisim.data.Value; import com.cburch.logisim.instance.InstanceData; import com.cburch.logisim.instance.InstanceState; /** Представляет состояние счетчика.

source: If it is connected to a multiple-bit value, then each bit in the value that is floating is pulled in the direction specified, while the bits that are not floating are left unchanged.
ru_ru: Если он подключен к многобитному значению, то каждый плавающий бит в этом значении будет изменён в указанном направлении, а не плавающие биты будут оставлены без изменений.

source: West edge, middle pin labeled D (input, bit with matches Data Bits attribute)
ru_ru: Западный край, средний контакт, отмечен D (вход, разрядность соответствует атрибуту Биты данных)

source: At all other times, this output is 0.
ru_ru: Во всех других случаях на этом выходе 0.

source: Notice how the three-bit output is the bitwise AND of the two inputs.
ru_ru: Обратите внимание, что трёхбитный выход является побитовым И для двух входов.

source: This randomness is disabled by default.)
ru_ru: Эта случайность отключена по умолчанию.)

source: Without bringing up any windows, Logisim loads the circuit and begins to execute it, ticking any clocks as fast as it can while completing the propagation between each tick.
ru_ru: Без вывода каких-либо окон Logisim загрузит схему и начнёт выполнять её, производя срабатывания тактовых генераторов так быстро, как только может, выполняя просчёт между каждым срабатыванием.

source: The bit width of the values to be multiplied and of the result.
ru_ru: Разрядность значений для умножения и результата.

source: Logisim cuts off its simulation after a fixed number of iterations assuming that there is an oscillation error.
ru_ru: Logisim выключает моделирование после определённого количества итераций, предполагая, что произошло возбуждение.

source: Thus, it is not the intent of this section to claim rights or contest your rights to work written entirely by you; rather, the intent is to exercise the right to control the distribution of derivative or collective works based on the Program.
ru_ru: Таким образом, содержание этого раздела не имеет цели претендовать на ваши права на произведение, написанное полностью вами, или оспаривать их; цель скорее в том, чтобы развить право управлять распространением производных или коллективных произведений, основанных на Программе.

source: Memory library: All components except ROM
ru_ru: Библиотека Память: все компоненты за исключением ПЗУ

source: Constant
ru_ru: Константа

source: If an input is neither 0 nor 1 (it is floating or it is the error value) then the component treats it as both 0 and 1: If the output would be the same both ways (as when an AND gate has one input that is definitely 0 and a questionable second input), that will be the output value; but if the output changes depending on whether it is 0 or 1, the output is the error value.
ru_ru: Если на входе не 0 и не 1 (он плавающий или на нём значение ошибки), то компонент относится к этому значению как к 0 и 1 одновременно: если значение на выходе будет одинаковым в обоих случаях (например, если на одном из входов элемента И определённо 0, а значение на втором входе под вопросом), то выходное значение будет присутствовать; но если выход изменяется в зависимости от того, что на входе - 0 или 1, то на выходе будет значение ошибки.

source: Notice than the number of repetitions is written in base 10.
ru_ru: Обратите внимание, что количество повторений записывается по основанию 10.

source: Each mouse-mapped tool has its own set of attributes, different from the attributes used in the explorer pane and in the toolbar.
ru_ru: Каждый привязанный к мыши инструмент имеет собственный набор атрибутов, отличающийся от атрибутов, используемых инструментами на панели проводника или панели инструментов.

source: License.
ru_ru: Лицензии.

source: The lower multibit input has as many bits as there are rows in the matrix, with the low-order bit corresponding to the bottom row.
ru_ru: Нижний многобитный вход имеет столько битов, сколько строк в матрице; младший бит соответствует нижней строке.

source: After adding component: By default, after adding each individual component, Logisim switches back to the Edit Tool to allow you to move components around and to add wires.
ru_ru: После добавления компонента: по умолчанию, после добавления каждого компонента, Logisim переключается на Инструмент Правка, позволяющий перемещать компоненты и добавлять провода.

source: if((ct & 1) == 0) { // if parity is even, flip 1's bit
ru_ru: if((ct & 1) == 0) { // если соотношение чётное, то поменять первый бит

source: The component is asynchronous in the sense that when the buffer is empty and the user types a character, that character is sent immediately as an output, without any wait for a clock pulse.
ru_ru: Компонент асинхронен в том смысле, что когда буфер пуст, и пользователь печатает символ, то символ посылается на выход немедленно, не дожидаясь импульса на тактовом входе.

source: All components have been customized to deal with three-bit data via its Data Bits attribute; the screen shot shows the AND gate attributes, including the Data Bits attribute of 3.
ru_ru: Все компоненты были настроены для работы с трёхбитными данными через их атрибут Биты данных; снимок экрана показывает атрибуты элемента И, включая атрибут Биты данных, имеющий значение 3.

source: Computes a truth table and Boolean expressions corresponding to the current circuit, displaying them in the Combinational Analysis window.
ru_ru: Вычисляет таблицу истинности и логические выражения, соответствующие текущей схеме, отображая их в окне Комбинационный анализ.

source: source code, which must be distributed under the terms of Sections
ru_ru: исходным кодом, который должен распространяться в соответствии с Разделами

source: South edge, indicated with a triangle (input, bit width 1)
ru_ru: Южный край, отмечен треугольником (вход, разрядность равна 1)

source: The bit width of the value placed onto the wire.
ru_ru: Разрядность значения, выдаваемого на провод.

source: After clicking OK, Logisim will display the standard page setup dialog box before printing the circuits.
ru_ru: После нажатия OK Logisim покажет диалоговое окно установок страницы до печати схем.

source: Contains classes related to the library definition.
ru_ru: Содержит классы, связанные с объявлением библиотеки.

source: (This peculiar behavior is necessary because pasting will otherwise merge the wires of the selection into the current circuit at once, and the wires there previously will be dragged with the pasted clipboard if the user wants to move the pasted components somewhere else.)
ru_ru: (Это своеобразное поведение необходимо, поскольку в противном случае вставка объединит провода выделения и текущей схемы, а провода, находившиеся там раньше, будут перетаскиваться со вставленным буфером, если пользователь захочет переместить вставленные компоненты куда-то ещё.)

source: When the component is selected or being added, the digits '1' through '4' alter its Select Bits attribute, Alt-0 through Alt-9 alter its Data Bits attribute, and the arrow keys alter its Facing attribute.
ru_ru: Когда компонент выбран, или уже добавлен, клавиши от 0 до 9 меняют его атрибут Выбирающие биты, комбинации от Alt-0 до Alt-9 меняют его атрибут Биты данных, а клавиши со стрелками меняют его атрибут Направление.

source: The Gates library includes a variety of simple components, all of which have a single output whose value is dictated entirely by the current inputs.
ru_ru: Библиотека Элементы включает в себя множество простых компонентов, которые имеют один выход, значение на котором полностью определяется значениями на входах.

source: Output for 11010100
ru_ru: Выходное значение для 11010100

source: The counter loads the value found at the D input.
ru_ru: Счётчик загружает значение со входа D.

source: /** Determines whether the location the mouse was pressed should result
ru_ru: /** Определяет, должно ли положение, в котором нажата мышь,

source: Outputs the value currently stored by the counter.
ru_ru: Выдаёт значение, хранящееся в данный момент в счётчике.

source: Clock
ru_ru: Тактовый генератор

source: Shift Register
ru_ru: Сдвиговый регистр

source: The bit width of the data being routed through the multiplexer.
ru_ru: Разрядность данных, проходящих через мультиплексор.

source: There is no way, though, to distinguish different RAM components: Logisim will attempt to load the same file into every RAM that it can find.
ru_ru: Однако, не существует способа различать разные компоненты ОЗУ: Logisim попытается загрузить тот же файл в каждое ОЗУ, которое он найдёт.

source: Contents
ru_ru: Содержимое

source: The NOT Gate emits the complement of whatever input it receives.
ru_ru: Элемент НЕ выдаёт на выход дополнение для того, что поступает на его вход.

source: As with the Columns format, a 1 indicates to light the corresponding pixel, and a 0 indicates to keep the pixel dim.
ru_ru: Как и при формате Столбцы, 1 указывает подсветить соответствующий пиксель, а 0 - оставить его не подсвеченным.

source: "Left" means that the text should be drawn so that its left edge is at the location; "right" means that the text should be drawn so that its right edge is at the location; and "center" means that the text should be drawn so that its center (horizontally) is at the location.
ru_ru: "Левое" означает, что текст должен быть отрисован так, чтобы его левый край находился в этом месте; "правое" означает, что текст должен быть отрисован так, чтобы его правый край находился в этом месте; и "по центру" означает, что текст должен быть отрисован так, чтобы его центр (горизонтальный) находился в этом месте.

source: This is unlikely to be a problem in practice, but one such a circumstance is a circuit that incorporates many of the below latch circuits with random noise enabled.
ru_ru: Это вряд ли будет проблемой на практике, но одним из таких случаев является схема, которая включает много схем триггеров, показанных ниже, с включенным случайным шумом.

source: You can also "extend" or "shorten" a wire by dragging one of its endpoints using the edit tool.
ru_ru: Вы также можете "удлинить" или "укоротить" провод, перетаскивая один из его концов, используя Инструмент Правка.

source: When the component is selected or being added, the digits '0' through '9' alter its Number of Inputs attribute and Alt-0 through Alt-9 alter its Data Bits attribute.
ru_ru: Когда компонент выбран, или уже добавлен, клавиши от 0 до 9 меняют его атрибут Количество входов, а комбинации от Alt-0 до Alt-9 меняют его атрибут Биты данных.

source: The component determines the indices of the inputs whose values are 1, and it emits the highest index.
ru_ru: Компонент определяет номера входов, значения на которых 1, и пускает на выход наибольший номер.

source: But splitters can also work the other way: It can combine multiple values into a single value.
ru_ru: Но разветвители также могут работать по-другому: они могут объединять несколько значений в одно значение.

source: The text's top and bottom is computed based on the font's standard ascent and descent values; thus, even if the actual text contains no tall letters (such as b) or descending letters (such as g), it is assumed to contain such letters for the purposes of vertical positioning.
ru_ru: Верх и низ текста вычисляется на основе стандартных значений высоты верхней планки высоких и нижней планки низких букв шрифта, поэтому, даже если сам текст не содержит высоких букв (таких как б ) или низких букв (таких как у ), в целях вертикального позиционирования предполагается, что такие буквы содержатся.

source: South edge, labeled b out (output, bit width 1)
ru_ru: Южный край, отмечен b out (выход, разрядность равна 1)

source: distributed under the terms of Sections 1 and 2 above on a medium
ru_ru: подлежащую распространению в соответствии с Разделами 1 и 2,

source: Circuits: A list where you can select one or more circuits to be printed.
ru_ru: Схемы: Список, где вы можете выбрать одну или несколько схем для печати.

source: The level-trigger options are unavailable for the T and J-K flip-flops, because a flip-flop behaves unpredictably when told to toggle for an indeterminate amount of time.
ru_ru: Варианты "... уровень" недоступны для T и J-K триггеров, так как триггер ведет себя непредсказуемо, если заставить его переключаться непрерывно на протяжении отрезка времени.

source: The Simulation tab allows configuration of the algorithm used for simulating circuits.
ru_ru: Вкладка Моделирование позволяет настраивать алгоритм, используемый для моделирования схем.

source: But if none of the first's indexed inputs are 1, then its output will be all-floating bits, and the second priority encoder will be enabled and it will identify the highest-priority input with a 1.
ru_ru: Но если ни один из нумерованных входов первого не содержит 1, то его выход будет плавающим, а второй шифратор приоритетов будет включен, и в нём будет определён старший вход с 1.
